Revit 2024 API
RebarContainerItem.GetCenterlineCurves Method
Overload List
Name | Description
GetCenterlineCurves(Boolean, Boolean, Boolean)
 A chain of curves representing the centerline of the rebar.
GetCenterlineCurves(Boolean, Boolean, Boolean, MultiplanarOption)
 A chain of curves representing the centerline of the rebar.
See Also
RebarContainerItem Class
RebarContainerItem Members
Autodesk.Revit.DB.Structure Namespace